# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [1]:
#!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
#!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
#!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

In [19]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5433'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://student:student@127.0.0.1:5433/pagila

'Connected: student@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table

In [3]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://student:***@127.0.0.1:5433/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [4]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://student:***@127.0.0.1:5433/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [5]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://student:***@127.0.0.1:5433/pagila
5 rows affected.

[(datetime.datetime(2007, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2007, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2007, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2007, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2007, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [6]:
%sql DROP TABLE test_table

 * postgresql://student:***@127.0.0.1:5433/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [20]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5433/pagila
40 rows affected.

[]

In [21]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT  c.customer_id  AS customer_key,
        c.customer_id,
        c.first_name,
        c.last_name,
        c.email,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        a.postal_code,
        a.phone,
        c.active,
        now()         AS create_date,
        now()         AS start_date,
        now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5433/pagila
599 rows affected.

[]

In [22]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language, rental_duration, length, rating, special_features)
SELECT 
    f.film_id      AS movie_key,
    f.film_id,
    f.title,
    f.description,
    f.release_year,
    l.name         AS language,
    orig_lang.name AS original_language,
    f.rental_duration,
    f.length,
    f.rating,
    f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5433/pagila
1000 rows affected.

[]

In [27]:
%%sql
INSERT INTO dimStore(store_key, store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT  s.store_id     AS store_key,
        s.store_id,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        a.postal_code,
        st.first_name  AS manager_first_name,
        st.last_name   AS manager_last_name,
        now()          AS first_date,
        now()          AS last_date
FROM store s
JOIN staff st    ON st.store_id = s.store_id
JOIN address a   ON a.address_id = s.address_id
JOIN city ci     ON ci.city_id = a.city_id
JOIN country co  ON ci.country_id = co.country_id

 * postgresql://student:***@127.0.0.1:5433/pagila
2 rows affected.

[]

In [28]:
%%sql
INSERT INTO factSales(date_key, customer_key, movie_key, store_key, sales_amount)
SELECT 
    DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
    p.customer_id                                                AS customer_key,
    i.film_id                                                    AS movie_key,
    i.store_id                                                   AS store_key,
    p.amount                                                     AS sales_amount
FROM payment p
JOIN rental r     ON r.rental_id = p.rental_id
JOIN inventory i  ON i.inventory_id = r.inventory_id

 * postgresql://student:***@127.0.0.1:5433/pagila
16049 rows affected.

[]

In [18]:
%%sql
#DROP TABLE factSales;
#DROP TABLE dimStore;
#DROP TABLE dimMovie;
#DROP TABLE dimCustomer;
#DROP TABLE dimDate;

 * postgresql://student:***@127.0.0.1:5433/pagila
Done.
Done.
Done.
Done.
Done.

[]